package Algoritms_Sample;

/*
Есть строка, в ней записаны слова через пробел: "abc de f"
Нужно in-place без использования дополнительной памяти изменить строку
Допускается добавлять несколько переменных
Проверка -> ["a", "b", " ", "f"] -> ["f", " ", "a", "b"]

Решение:
1 - сначала проходим по массиву символов и разворачиваем его
2 - проходим по массиву символов, определяем пробел как разделеитель и как границу слова
3 - разворачиваем слово в отдельном цикле, и переходим к следующему слову
*/


public class AppTasks005_Change_String_In_place {

    public static void main(String[] args) {

        


    }

}
